NEWA_TO_DEV_MAP = {
    '𑐀': 'अ', '𑐁': 'आ', '𑐂': 'इ', '𑐃': 'ई', '𑐄': 'उ', '𑐅': 'ऊ', 
    '𑐊': 'ए', '𑐋': 'ऐ', '𑐌': 'ओ', '𑐍': 'औ',
    '𑐎': 'क', '𑐏': 'ख', '𑐐': 'ग', '𑐑': 'घ', '𑐒': 'ङ',
    '𑐓': 'च', '𑐔': 'छ', '𑐕': 'ज', '𑐖': 'झ', '𑐗': 'ञ',
    '𑐘': 'ट', '𑐙': 'ठ', '𑐚': 'ड', '𑐛': 'ढ', '𑐜': 'ण',
    '𑐝': 'त', '𑐞': 'थ', '𑐟': 'द', '𑐠': 'ध', '𑐡': 'न',
    '𑐢': 'प', '𑐣': 'न', '𑐤': 'फ', '𑐥': 'प', '𑐦': 'फ', 
    '𑐧': 'ब', '𑐨': 'भ', '𑐩': 'म', '𑐪': 'र', '𑐫': 'य', 
    '𑐮': 'ल', '𑐰': 'व', '𑐱': 'श', '𑐲': 'ष', '𑐳': 'स', '𑐴': 'ह',
    '𑐵': 'ा', '𑐶': 'ि', '𑐷': 'ी', '𑐸': 'ु', '𑐹': 'ू', 
    '𑐾': 'े', '𑐿': 'ै', '𑑀': 'ो', '𑑁': 'ौ',
    '𑑂': '्', '𑑃': 'ँ', '𑑄': 'ं', '𑑅': 'ः'
}

TRANS_TABLE = str.maketrans(NEWA_TO_DEV_MAP)

def transliterate(text: str) -> str:
    """Converts input Prachalit text string into Devanagari."""
    if not text:
        return ""
    return text.translate(TRANS_TABLE)