NEWA_TO_DEV_MAP = {
    '𑐀': 'अ', '𑐁': 'आ', '𑐂': 'इ', '𑐃': 'ई', '𑐄': 'उ', '𑐅': 'ऊ', 
    '𑐊': 'ए', '𑐋': 'ऐ', '𑐌': 'ओ', '𑐍': 'औ',
    '𑐎': 'क', '𑐏': 'ख', '𑐐': 'ग', '𑐑': 'घ', '𑐒': 'ङ',
    '𑐔': 'च', '𑐕': 'छ', '𑐖': 'ज', '𑐗': 'झ', '𑐘': 'ञ',
    '𑐚': 'ट', '𑐛': 'ठ', '𑐜': 'ड', '𑐝': 'ढ', '𑐞': 'ण',
    '𑐟': 'त', '𑐠': 'थ', '𑐡': 'द', '𑐢': 'ध', '𑐣': 'न',
    '𑐥': 'प', '𑐦': 'फ', '𑐧': 'ब', '𑐨': 'भ', '𑐩': 'म',
    '𑐫': 'य', '𑐬': 'र', '𑐮': 'ल', '𑐰': 'व', '𑐱': 'श',
    '𑐲': 'ष', '𑐳': 'स', '𑐴': 'ह',
    '𑐵': 'ा', '𑐶': 'ि', '𑐷': 'ी', '𑐸': 'ु', '𑐹': 'ू', 
    '𑐾': 'े', '𑐿': 'ै', '𑑀': 'ो', '𑑁': 'ौ',
    '𑑂': '्', '𑑃': 'ँ', '𑑄': 'ं', '𑑅': 'ः'
}

TRANS_TABLE = str.maketrans(NEWA_TO_DEV_MAP)

def transliterate(text: str) -> str:
    """Converts input Prachalit text string into Devanagari."""
    if not text:
        return ""
    return text.translate(TRANS_TABLE)